{
  "message": "en",
  "company": {
    "name": "uEngine Solutions. Co.",
    "address": "502, 18, Sinbanpo-ro 45-gil, Seocho-gu, Seoul, Republic of Korea",
    "number": "02-567-8301",
    "ceo": "Jinyoung, Jang",
    "registrationNumber": "2118795355",
    "refundNumber": "02-567-8301",
    "refundUser": "Sooheon, Lee"
  },
  "word": {
    "address": "Address",
    "number": "Tel",
    "refundUser": "Complaints officer",
    "ceo": "CEO/CTO",
    "registrationNumber": "Registration number",
    "terms": "Terms of Use",
    "privacy": "Privacy Policy",
    "recommendWord": "Recommend Word",
    "recommendWordDetail": "Changed when selected.",
    "introduceText": "MSAEZ Introduce",
    "QuestionsBoard" : "Q&A Board",
    "progressState":"Progress State",
    "deleteNotification":"Delete Notification",
    "delete": "Delete",
    "close": "Close",
    "useIDE": "Launch IDE",
    "biz": "Biz",
    "dev": "Dev"
  },
  "main": {
    "title": "Microservices Architecture made easy!",
    "content1": "Frontend, Auth/Authz, GraphQL, etc. - All Patterns supported by modeling",
    "content2": "Event driven microservices with Kafka, Spring, Axon, Eventuate",
    "content3": "Container & Kubernetes Deploy Diagramming",
    "title2": "Don’t worry about the implementation. Just focus on your ideas.",
    "content4": "Now, leave your business analysis and system design to Chat GPT-based AI service.",
    "content5": "Create Business Model Canvas, Customer Journey Map, Eventstorming Model and User Story automatically.",
    "content6": "Just add your unique ideas",
    "content7": "and get straight into implementation with the source codes created by template and AI"
  },
  "tools": {
    "modeling": "MODELING TOOLS",
    "eventstorming": "Eventstorming",
    "eventstorming-inst": "Event Storming is a workshop for MSA DDD that is conducted with Sticky Notes.",
    "kubernetes": "Kubernetes Modeling",
    "kubernetes-inst": "Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications.",
    "bmc": "Business Model Canvas",
    "bmc-inst": "The Business Model Canvas is a strategic management template used for developing new business models and documenting existing ones.",
    "bpmn": "BPMN",
    "bpmn-inst": "Business Process Model and Notation (BPMN) is a graphical representation for specifying business processes in a business process model.",
    "tutorial-btn": "TUTORIAL",
    "video-btn": "VIDEOS",
    "create-btn": "CREATE"
  },
  "tutorials": {
    "tutorial": "TUTORIALS",
    "axon": "Applying Axon Framework",
    "axon-inst": "A saga patterned eventstorming model for microservice application based on Axon Framework",
    "ddd": "DDD-Eventstorming",
    "ddd-inst": "Eventstorming example based on Google Drive scenario",
    "unit": "Running unit Microservice",
    "unit-inst": "Gradual implementation by running Cloud IDE-based unit microservices & mutual test",
    "reqres": "MSA Communication by Req/Res",
    "reqres-inst": "Applying synchronous calls between monoliths and microservices, or between microservices",
    "cb": "Circuit Breaker",
    "cb-inst": "Fail-Fast strategy pattern to block failure propagation in advance in synchronous communication between services",
    "pubsub": "Pub-Sub Comunication",
    "pubsub-inst": "Applying EDA-based message communication with non-blocking & fault isolation",
    "comcor": "Compensation & Correlation",
    "comcor-inst": "Managing consistency by compensation handling when transaction fails in MSA environment",
    "jwt": "JWT Token-based Authorization",
    "jwt-inst": "Applying Single-Sign-On pattern for authentication & authorization of microservices",
    "hateoas": "Data Projection w/ Frontend & HATEOAS",
    "hateoas-inst": "Implementing HATEOAS API to deliver a link for state transition & Frontend based on it",
    "graphql": "Data Projection w/ GraphQL",
    "graphql-inst": "Creating GraphQL-based backend application for data composition"
  },
  "examples": {
    "modeling": "MODELING EXAMPLES",
    "axon": "Axon Saga",
    "pet": "Pet Shop",
    "food": "Food Delivery",
    "shop": "Shopping",
    "k8s": "k8s Blueprint",
    "google": "Google Drive",
    "enter-btn": "ENTER"
  },
  "loading": {
    "main-title": "Loading IDE",
    "main-detail": "This may take a few minutes.",
    "sub-title": "If you can't wait a few minutes",
    "sub-title-1": "Please check the following items",
    "sub-detail": "1. Use the Chrome browser",
    "sub-detail-1": "2. Click the refresh button",
    "sub-detail-2": "3. The browser keeps only one tab possible",
    "sub-detail-3": "4. If a special security program is installed, request to release this site."
  },
  "permission": {
    "read": "View Only",
    "write": "Editable"
  },
  "loginList": {
    "purchaseList": "Purchase/History",
    "CoinsCoupons": "Coupons or coins",
    "inquiry": "Request a demo / Question( help@uengine.org )",
    "logout": "Logout",
    "LoginInformation1": "*Since there would be limits on functional usage if you sign in with Google",
    "LoginInformation2": "we recommend you to sign in with Github.",
    "LoginInformation3": "Welcome to MSAEZ.",
    "LoginInformation4": "You can use this lecture after logging in.",
    "cookieCheck1": "Please ensure 3rd party cookies are enabled if",
    "cookieCheck2": "login fails."
  },
  "info": {
    "refundComment": "In case of complaints about exchange/refund for products, 'uEngine Solutions' handles it, and 'uEngine Solutions' is responsible for all the responsibilities."
  },
  "myPage": {
    "purchaseManagement": "Purchase Management",
    "privacy": "Privacy",
    "couponManagement": "Coupon Management",
    "certification": "Certification",
    "purchaseList": "Purchase/History",
    "individualPurchaseList": "Individual Purchase and usage history",
    "issuedDate": "Issued Date",
    "expiredDate": "Expired Date",
    "remainIDE": "Remain IDE time",
    "remainLab": "Remain available Lab",
    "individualEmail": "Individual Email"
  },
  "autoModeling": {
    "main1": "What do you want to create today?",
    "main2": "What do you want to create today? e.g. Class management system, Taxi-call service system",
    "mainClick": "Input Service Name e.g. Class management system, Taxi-call service system",
    "selectOptions": "Please select the desired option you wish to create!",
    "selectMessage1": "Sounds interesting! Let me come up with a few ideas...",
    "selectMessage2": "Here's a user story for you.",
    "explanation": "You can edit this user story, or create model as is:",
    "scenario": "You can edit this scenario:",
    "user": "Generating Persona... Choose a persona to generate customer journey map:"
  },
  "UIWizardDialoger": {
    "imageMessage": "Here are a logo for this service:",
    "colorPaletteMessage": "Here are color palette recommendation for this service:",
    "fontPaletteMessage" : "The font recommendations palette for this service is as follows:"
  },
  "Preview": {
    "serviceName": "Change Service Name",
    "serviceScenarios": "Change service description"
  },
  "provision": {
    "terms": "  These Terms of Use (\"Terms\") were last updated on May 1, 2021.<br/><br/>\n\n uEngine mission is to improve lives through learning. We enable anyone anywhere to create and share educational content (instructors) and to access that educational content to learn (students).<br/>\n                            We consider our marketplace model the best way to offer valuable educational content to our users. We need rules to keep our platform and services safe for you, us, and our student and instructor community. These Terms apply to all your activities on the MSAEZ website, the MSAEZ mobile applications, our TV applications, our APIs, and other related services (“Services”).<br/>\n                            If you publish a course on the MSAEZ platform, you must also agree to the Instructor Terms. We also provide details regarding our processing of personal data of our students and instructors in our Privacy Policy. If you are using MSAEZ as part of your employer’s MSAEZ Business learning and development program, you can consult our MSAEZ Business Privacy Statement.<br/>\n                            <br/>\n                            <b>If you live in the United States or Canada, by agreeing to these Terms, you agree to resolve disputes with MSAEZ through binding arbitration (with very limited exceptions, not in court), and you waive certain rights to participate in class actions, as detailed in the Dispute Resolution section.</b><br/>\n                            <br/><br/>\n                            Table of Contents<br/>\n                            &emsp;1. Accounts<br/>\n                            &emsp;2. Content Enrollment and Lifetime Access<br/>\n                            &emsp;3. Payments, Credits, and Refunds<br/>\n                            &emsp;4. Content and Behavior Rules<br/>\n                            &emsp;5. MSAEZ's Rights to Content You Post<br/>\n                            &emsp;6. Using MSAEZ at Your Own Risk<br/>\n                            &emsp;7. MSAEZ's Rights<br/>\n                            &emsp;8. Subscription Terms<br/>\n                            &emsp;9. Miscellaneous Legal Terms<br/>\n                            &emsp;10. Dispute Resolution<br/>\n                            &emsp;11. Updating These Terms<br/>\n                            &emsp;12. How to Contact Us<br/>\n                            <br/><br/>\n                            <h3>1. Accounts</h3>\n                            &emsp;You need an account for most activities on our platform. Keep your password somewhere safe, because you’re responsible for all activity associated with your account.\n                            If you suspect someone else is using your account, let us know by contacting our Support Team. You must have reached the age of consent for online services in your country to use MSAEZ.\n                            You need an account for most activities on our platform, including to purchase and access content or to submit content for publication. When setting up and maintaining your account, you must provide and continue to provide accurate and complete information, including a valid email address. You have complete responsibility for your account and everything that happens on your account, including for any harm or damage (to us or anyone else) caused by someone using your account without your permission. This means you need to be careful with your password. You may not transfer your account to someone else or use someone else’s account. If you contact us to request access to an account, we will not grant you such access unless you can provide us with the information that we need to prove you are the owner of that account. In the event of the death of a user, the account of that user will be closed.\n                            <br/><br/>\n                            You may not share your account login credentials with anyone else. You are responsible for what happens with your account and MSAEZ will not intervene in disputes between students or instructors who have shared account login credentials. You must notify us immediately upon learning that someone else may be using your account without your permission (or if you suspect any other breach of security) by contacting our Support Team. We may request some information from you to confirm that you are indeed the owner of your account.\n                            <br/><br/>\n                            Students and instructors must be at least 18 years of age to create an account on MSAEZ and use the Services. If you are younger than 18 but above the required age for consent to use online services where you live (for example, 13 in the US or 16 in Ireland), you may not set up an account, but we encourage you to invite a parent or guardian to open an account and help you access content that is appropriate for you. If you are below this age of consent to use online services, you may not create a MSAEZ account. If we discover that you have created an account that violates these rules, we will terminate your account. Under our Instructor Terms, you may be requested to verify your identity before you are authorized to submit content for publication on MSAEZ.\n                            You can terminate your account at any time by following the steps here. Check our Privacy Policy to see what happens when you terminate your account.\n                            <br/><br/>\n\n                            <h3>2. Content Enrollment and Lifetime Access</h3>\n                            &emsp;When you enroll in a course or other content, you get a license from us to view it via the MSAEZ Services and no other use. Don’t try to transfer or resell content in any way. We generally grant you a lifetime access license, except when we must disable the content because of legal or policy reasons or for enrollments via Subscription Plans.\n                            Under our Instructor Terms, when instructors publish content on MSAEZ, they grant MSAEZ a license to offer a license to the content to students. This means that we have the right to sublicense the content to enrolled students. As a student, when you enroll in a course or other content, whether it’s free or paid content, you are getting a license from MSAEZ to view the content via the MSAEZ platform and Services, and MSAEZ is the licensor of record. Content is licensed, and not sold, to you. This license does not give you any right to resell the content in any manner (including by sharing account information with a purchaser or illegally downloading the content and sharing it on torrent sites).\n                            <br/><br/>\n                            In legal, more complete terms, MSAEZ grants you (as a student) a limited, non-exclusive, non-transferable license to access and view the content for which you have paid all required fees, solely for your personal, non-commercial, educational purposes through the Services, in accordance with these Terms and any conditions or restrictions associated with the particular content or feature of our Services. All other uses are expressly prohibited. You may not reproduce, redistribute, transmit, assign, sell, broadcast, rent, share, lend, modify, adapt, edit, create derivative works of, sublicense, or otherwise transfer or use any content unless we give you explicit permission to do so in a written agreement signed by a MSAEZ authorized representative. This also applies to content you can access via any of our APIs.\n                            <br/><br/>\n                            We generally give a lifetime access license to our students when they enroll in a course or other content. However, we reserve the right to revoke any license to access and use any content at any point in time in the event where we decide or are obligated to disable access to the content due to legal or policy reasons, for example, if the course or other content you enrolled in is the object of a copyright complaint, or if we determine it violates our Trust & Safety Guidelines. This lifetime access license does not apply to enrollments via Subscription Plans or to add-on features and services associated with the course or other content you enroll in. For example, instructors may decide at any time to no longer provide teaching assistance or Q&A services in association with the content. To be clear, the lifetime access is to the course content but not to the instructor.\n                            <br/><br/>\n                            Instructors may not grant licenses to their content to students directly, and any such direct license shall be null and void and a violation of these Terms.<br/>\n                            <br/><br/>\n\n                            <h3>3. Payments, Credits, and Refunds</h3>\n                            &emsp;When you make a payment, you agree to use a valid payment method. If you aren’t happy with your content, MSAEZ offers a 30-day refund or credit for most content purchases.<br/>\n                            <br/><br/>\n                            <h4>3.1 Pricing</h4>\n                            &emsp;The prices of content on MSAEZ are determined based on the terms of the Instructor Terms and our Promotions Policy. In some instances, the price of content offered on the MSAEZ website may not be exactly the same as the price offered on our mobile or TV applications, due to mobile platform providers’ pricing systems and their policies around implementing sales and promotions.\n                            <br/><br/>\n                            We occasionally run promotions and sales for our content, during which certain content is available at discounted prices for a set period of time. The price applicable to the content will be the price at the time you complete your purchase of the content (at checkout). Any price offered for particular content may also be different when you are logged into your account from the price available to users who aren’t registered or logged in, because some of our promotions are available only to new users.\n                            <br/><br/>\n                            If you are logged into your account, the listed currency you see is based on your location when you created your account. If you are not logged into your account, the price currency is based on the country where you are located. We do not enable users to see pricing in other currencies.\n                            <br/><br/>\n                            If you are a student located in a country where use and sales tax, goods and services tax, or value added tax is applicable to consumer sales, we are responsible for collecting and remitting that tax to the proper tax authorities. Depending on your location, the price you see may include such taxes, or tax may be added at checkout.\n                            <br/><br/>\n                            <h4>3.2 Payments</h4>\n                            &emsp;You agree to pay the fees for content that you purchase, and you authorize us to charge your debit or credit card or process other means of payment (such as Boleto, SEPA, direct debit, or mobile wallet) for those fees. MSAEZ works with payment service providers to offer you the most convenient payment methods in your country and to keep your payment information secure. We may update your payment methods using information provided by our payment service providers. Check out our Privacy Policy for more details.\n                            When you make a purchase, you agree not to use an invalid or unauthorized payment method. If your payment method fails and you still get access to the content you are enrolling in, you agree to pay us the corresponding fees within thirty (30) days of notification from us. We reserve the right to disable access to any content for which we have not received adequate payment.\n                            <br/><br/>\n                            <h4>3.3 Refunds and Refund Credits</h4>\n                            &emsp;If the content you purchased is not what you were expecting, you can request, within 30 days of your purchase of the content, that MSAEZ apply a refund to your account. This refund option does not apply to Subscription Plan purchases, which are covered in Section 8.4 below. We reserve the right to apply your refund as a refund credit or a refund to your original payment method, at our discretion, depending on capabilities of our payment service providers, the platform from which you purchased your content (website, mobile or TV app), and other factors. No refund is due to you if you request it after the 30-day guarantee time limit has passed. However, if the content you previously purchased is disabled for legal or policy reasons, you are entitled to a refund beyond this 30-day limit. MSAEZ also reserves the right to refund students beyond the 30-day limit in cases of suspected or confirmed account fraud.\n                            <br/><br/>\n                            To request a refund, follow the steps here. As detailed in the Instructor Terms, instructors agree that students have the right to receive these refunds.\n                            <br/><br/>\n                            If we decide to issue refund credits to your account, they will be automatically applied towards your next content purchase on our website, but can’t be used for purchases in our mobile or TV applications. Refund credits may expire if not used within the specified period and have no cash value, in each case unless otherwise required by applicable law.\n                            <br/><br/>\n                            At our discretion, if we believe you are abusing our refund policy, such as if you’ve consumed a significant portion of the content that you want to refund or if you’ve previously refunded the content, we reserve the right to deny your refund, restrict you from other future refunds, ban your account, and/or restrict all future use of the Services. If we ban your account or disable your access to the content due to your violation of these Terms or our Trust & Safety Guidelines, you will not be eligible to receive a refund. Additional information on our refund policy is available here.\n                            <br/><br/>\n                            <h4>3.4 Gift and Promotional Codes</h4>\n                            &emsp;MSAEZ or our partners may offer gift and promotional codes to students. Certain codes may be redeemed for gift or promotional credits applied to your MSAEZ account, which then may be used to purchase eligible content on our platform, subject to the terms included with your codes. Other codes may be directly redeemable for specific content. Gift and promotional credits can’t be used for purchases in our mobile or TV applications.\n                            <br/><br/>\n                            These codes and credits, as well as any promotional value linked to them, may expire if not used within the period specified in your MSAEZ account. Gift and promotional codes offered by MSAEZ may not be refunded for cash, unless otherwise specified in the terms included with your codes or as required by applicable law. Gift and promotional codes offered by a partner are subject to that partner’s refund policies. If you have multiple saved credit amounts, MSAEZ may determine which of your credits to apply to your purchase. Check out our Support Page and any terms included with your codes for more details.\n                            <br/><br/>\n\n                            <h3>4. Content and Behavior Rules</h3>\n                            &emsp;You can only use MSAEZ for lawful purposes. You’re responsible for all the content that you post on our platform. You should keep the reviews, questions, posts, courses and other content you upload in line with our Trust & Safety Guidelines and the law, and respect the intellectual property rights of others. We can ban your account for repeated or major offenses. If you think someone is infringing your copyright on our platform, let us know.\n                            You may not access or use the Services or create an account for unlawful purposes. Your use of the Services and behavior on our platform must comply with applicable local or national laws or regulations of your country. You are solely responsible for the knowledge of and compliance with such laws and regulations that are applicable to you.\n                            <br/><br/>\n                            If you are a student, the Services enable you to ask questions to the instructors of courses or other content you are enrolled in, and to post reviews of content. For certain content, the instructor may invite you to submit content as “homework” or tests. Don’t post or submit anything that is not yours.\n                            <br/><br/>\n                            If you are an instructor, you can submit content for publication on the platform and you can also communicate with the students who have enrolled in your courses or other content. In both cases, you must abide by the law and respect the rights of others: you cannot post any course, question, answer, review or other content that violates applicable local or national laws or regulations of your country. You are solely responsible for any courses, content, and actions you post or take via the platform and Services and their consequences. Make sure you understand all the copyright restrictions set forth in the Instructor Terms before you submit any content for publication on MSAEZ.\n                            <br/><br/>\n                            If we are put on notice that your course or content violates the law or the rights of others (for example, if it is established that it violates intellectual property or image rights of others, or is about an illegal activity), if we discover that your content or behavior violates our Trust & Safety Guidelines, or if we believe your content or behavior is unlawful, inappropriate, or objectionable (for example if you impersonate someone else), we may remove your content from our platform. MSAEZ complies with copyright laws. Check out our Intellectual Property Policy for more details.\n                            <br/><br/>\n                            MSAEZ has discretion in enforcing these Terms and our Trust & Safety Guidelines. We may restrict or terminate your permission to use our platform and Services or ban your account at any time, with or without notice, for any or no reason, including for any violation of these Terms, if you fail to pay any fees when due, for fraudulent chargeback requests, upon the request of law enforcement or government agencies, for extended periods of inactivity, for unexpected technical issues or problems, if we suspect that you engage in fraudulent or illegal activities, or for any other reason in our sole discretion. Upon any such termination we may delete your account and content, and we may prevent you from further access to the platforms and use of our Services. Your content may still be available on the platforms even if your account is terminated or suspended. You agree that we will have no liability to you or any third party for termination of your account, removal of your content, or blocking of your access to our platforms and services.\n                            <br/><br/>\n                            If a user has published content that infringes your copyright or trademark rights, please let us know. Our Instructor Terms require our instructors to follow the law and respect the intellectual property rights of others. For more details on how to file a copyright or trademark infringement claim with us, see our Intellectual Property Policy.\n                            <br/><br/>\n\n                            <h3>5. MSAEZ’s Rights to Content You Post</h3>\n                            &emsp;You retain ownership of content you post to our platform, including your courses. We’re allowed to share your content to anyone through any media, including promoting it via advertising on other websites.\n                            The content you post as a student or instructor (including courses) remains yours. By posting courses and other content, you allow MSAEZ to reuse and share it but you do not lose any ownership rights you may have over your content. If you are an instructor, be sure to understand the content licensing terms that are detailed in the Instructor Terms.\n                            <br/><br/>\n                            When you post content, comments, questions, reviews, and when you submit to us ideas and suggestions for new features or improvements, you authorize MSAEZ to use and share this content with anyone, distribute it and promote it on any platform and in any media, and to make modifications or edits to it as we see fit.\n                            <br/><br/>\n                            In legal language, by submitting or posting content on or through the platforms, you grant us a worldwide, non-exclusive, royalty-free license (with the right to sublicense) to use, copy, reproduce, process, adapt, modify, publish, transmit, display, and distribute your content (including your name and image) in any and all media or distribution methods (existing now or later developed). This includes making your content available to other companies, organizations, or individuals who partner with MSAEZ for the syndication, broadcast, distribution, or publication of content on other media, as well as using your content for marketing purposes. You also waive any rights of privacy, publicity, or other rights of a similar nature applicable to all these uses, to the extent permissible under applicable law. You represent and warrant that you have all the rights, power, and authority necessary to authorize us to use any content that you submit. You also agree to all such uses of your content with no compensation paid to you.\n                            <br/><br/>\n\n                            <h3>6. Using MSAEZ at Your Own Risk</h3>\n                            &emsp;Anyone can use MSAEZ to create and publish content and instructors and we enable instructors and students to interact for teaching and learning. Like other platforms where people can post content and interact, some things can go wrong, and you use MSAEZ at your own risk.\n                            <br/><br/>\n                            Our platform model means we do not review or edit the content for legal issues, and we are not in a position to determine the legality of content. We do not exercise any editorial control over the content that is available on the platform and, as such, do not guarantee in any manner the reliability, validity, accuracy, or truthfulness of the content. If you access content, you rely on any information provided by an instructor at your own risk.\n                            <br/><br/>\n                            By using the Services, you may be exposed to content that you consider offensive, indecent, or objectionable. MSAEZ has no responsibility to keep such content from you and no liability for your access or enrollment in any course or other content, to the extent permissible under applicable law. This also applies to any content relating to health, wellness, and physical exercise. You acknowledge the inherent risks and dangers in the strenuous nature of these types of content, and by accessing such content you choose to assume those risks voluntarily, including risk of illness, bodily injury, disability, or death. You assume full responsibility for the choices you make before, during, and after your access to the content.\n                            <br/><br/>\n                            When you interact directly with a student or an instructor, you must be careful about the types of personal information that you share. While we restrict the types of information instructors may request from students, we do not control what students and instructors do with the information they obtain from other users on the platform. You should not share your email or other personal information about you for your safety.\n                            <br/><br/>\n                            We do not hire or employ instructors nor are we responsible or liable for any interactions involved between instructors and students. We are not liable for disputes, claims, losses, injuries, or damage of any kind that might arise out of or relate to the conduct of instructors or students.\n                            <br/><br/>\n                            When you use our Services, you will find links to other websites that we don’t own or control. We are not responsible for the content or any other aspect of these third-party sites, including their collection of information about you. You should also read their terms and conditions and privacy policies.\n                            <br/><br/>\n\n                            <h3> 7. MSAEZ’s Rights</h3>\n                            &emsp;We own the MSAEZ platform and Services, including the website, present or future apps and services, and things like our logos, API, code, and content created by our employees. You can’t tamper with those or use them without authorization.\n                            All right, title, and interest in and to the MSAEZ platform and Services, including our website, our existing or future applications, our APIs, databases, and the content our employees or partners submit or provide through our Services (but excluding content provided by instructors and students) are and will remain the exclusive property of MSAEZ and its licensors. Our platforms and services are protected by copyright, trademark, and other laws of both the United States and foreign countries. Nothing gives you a right to use the MSAEZ name or any of the MSAEZ trademarks, logos, domain names, and other distinctive brand features. Any feedback, comments, or suggestions you may provide regarding MSAEZ or the Services is entirely voluntary and we will be free to use such feedback, comments, or suggestions as we see fit and without any obligation to you.\n                            <br/><br/>\n                            You may not do any of the following while accessing or using the MSAEZ platform and Services:\n                            <br/>\n                            &emsp;&emsp;<ul>\n                                    <li>access, tamper with, or use non-public areas of the platform (including content storage), MSAEZ’s computer systems, or the technical delivery systems of MSAEZ’s service providers.</li>\n                                    <li>disable, interfere with, or try to circumvent any of the features of the platforms related to security or probe, scan, or test the vulnerability of any of our systems.</li>\n                                    <li>copy, modify, create a derivative work of, reverse engineer, reverse assemble, or otherwise attempt to discover any source code of or content on the MSAEZ platform or Services.</li>\n                                    <li>access or search or attempt to access or search our platform by any means (automated or otherwise) other than through our currently available search functionalities that are provided via our website, mobile apps, or API (and only pursuant to those API terms and conditions). You may not scrape, spider, use a robot, or use other automated means of any kind to access the Services.</li>\n                                    <li>in any way use the Services to send altered, deceptive, or false source-identifying information (such as sending email communications falsely appearing as MSAEZ); or interfere with, or disrupt, (or attempt to do so), the access of any user, host, or network, including, without limitation, sending a virus, overloading, flooding, spamming, or mail-bombing the platforms or services, or in any other manner interfering with or creating an undue burden on the Services.</li>\n                                </ul>\n\n\n\n\n\n                            <br/><br/>\n                            <h3>8. Subscription Terms</h3>\n                            &emsp;This section covers additional terms that apply to your use of our subscription-based collections as a student (“Subscription Plans”). By using a Subscription Plan, you agree to the additional terms in this section. Note that use of MSAEZ Business is not subject to these Terms, but is instead governed by the agreement between MSAEZ and the subscribing organization.\n                            <br/><br/>\n                            <h4>8.1 Subscription Plans</h4>\n                            &emsp;During your subscription to a Subscription Plan, you get a limited, non-exclusive, non-transferable license from us to access and view the content included in that Subscription Plan via the Services. With the exception of the lifetime access license grant, the terms included in the “Content Enrollment and Lifetime Access” section above apply to enrollments via Subscription Plans.\n                            <br/><br/>\n                            The subscription that you purchase or renew determines the scope, features, and price of your access to a Subscription Plan. You may not transfer, assign, or share your subscription with anyone else.\n                            <br/><br/>\n                            We reserve the right to revoke any license to use the content in our Subscription Plans for legal or policy reasons at any time and at our sole discretion, such as if we no longer have the right to offer the content through a Subscription Plan. Additional information on our right to revoke is included in the “Content Enrollment and Lifetime Access” section.\n                            <br/><br/>\n                            <h4>8.2 Account Management</h4>\n                            &emsp;You may cancel your subscription by following the steps outlined on our Support Page. If you cancel your subscription to a Subscription Plan, your access to that Subscription Plan will automatically end on the last day of your billing period. On cancellation, you will not be entitled to receive a refund or credit of any fees already paid for your subscription, unless otherwise required by applicable law. For clarity, cancellation of a subscription does not terminate your MSAEZ account.\n                            <br/><br/>\n                            <h4>8.3 Free Trials & Renewals</h4>\n                            &emsp;Your subscription may start with a free trial. The duration of the free trial period of your subscription will be specified during sign-up. MSAEZ determines free trial eligibility at our sole discretion and may limit eligibility or duration. We reserve the right to terminate the free trial and suspend your subscription if we determine that you aren’t eligible.\n                            We will charge the subscription fee for your next billing cycle at the end of the free trial period. Your subscription will automatically renew according to your subscription settings (e.g., monthly or annually) unless you cancel your subscription prior to the end of the free trial period. For more information on how to view applicable fees and dates of your free trial period, visit our Support Page.\n                            <br/><br/>\n                            <h4>8.4 Payments and Billing</h4>\n                            &emsp;The subscription fee will be listed at the time of your purchase. You can visit our Support Page to learn more about where to find the fees and dates applicable to your subscription. We may also be required to add taxes to your subscription fee as described in the “Payments, Credits, and Refunds” section above. Payments are non-refundable and there are no refunds or credits for partially used periods, unless otherwise required by applicable law. Depending on where you are located, you may qualify for a refund. See our Refund Policy for Subscription Plans for additional information.\n                            To subscribe to a Subscription Plan, you must provide a payment method. By subscribing to a Subscription Plan and providing your billing information during checkout, you grant us and our payment service providers the right to process payment for the then-applicable fees via the payment method we have on record for you. At the end of each subscription term, we will automatically renew your subscription for the same length of term and process your payment method for payment of the then-applicable fees.\n                            In the event that we update your payment method using information provided by our payment service providers (as described in the “Payments, Credits, and Refunds” section above), you authorize us to continue to charge the then-applicable fees to your updated payment method.\n                            If we are unable to process payment through the payment method we have on file for you, or if you file a chargeback disputing charges made to your payment method and the chargeback is granted, we may suspend or terminate your subscription.\n                            We reserve the right to change our Subscription Plans or adjust pricing for our Services at our sole discretion. Any price changes or changes to your subscription will take effect following notice to you, except as otherwise required by applicable law.\n                            <br/><br/>\n                            <h4>8.5 Subscription Disclaimers</h4>\n                            &emsp;We make no guarantees as to the availability of any specific content in any Subscription Plan or as to any minimum amount of content in any Subscription Plan. At any point in the future, we reserve the right to offer or cease to offer additional features to any Subscription Plan, or to otherwise modify or terminate a Subscription Plan at our sole discretion. These disclaimers are in addition to those listed in the “Disclaimers” section below.\n                            <br/><br/>\n\n                            <h3>9. Miscellaneous Legal Terms</h3>\n                            &emsp;These Terms are like any other contract, and they have boring but important legal terms that protect us from the countless things that could happen and that clarify the legal relationship between us and you.\n                            <br/><br/>\n                            <h4>9.1 Binding Agreement</h4>\n                            &emsp;You agree that by registering, accessing, or using our Services, you are agreeing to enter into a legally binding contract with MSAEZ. If you do not agree to these Terms, do not register, access, or otherwise use any of our Services.\n                            If you are an instructor accepting these Terms and using our Services on behalf of a company, organization, government, or other legal entity, you represent and warrant that you are authorized to do so.\n                            Any version of these Terms in a language other than English is provided for convenience and you understand and agree that the English language will control if there is any conflict.\n                            These Terms (including any agreements and policies linked from these Terms) constitute the entire agreement between you and us (which include, if you are an instructor, the Instructor Terms and the Promotions Policy).\n                            If any part of these Terms is found to be invalid or unenforceable by applicable law, then that provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of these Terms will continue in effect.\n                            Even if we are delayed in exercising our rights or fail to exercise a right in one case, it doesn’t mean we waive our rights under these Terms, and we may decide to enforce them in the future. If we decide to waive any of our rights in a particular instance, it doesn’t mean we waive our rights generally or in the future.\n                            The following sections shall survive the expiration or termination of these Terms: Sections 2 (Content Enrollment and Lifetime Access), 5 (MSAEZ’s Rights to Content You Post), 6 (Using MSAEZ at Your Own Risk), 7 (MSAEZ’s Rights), 8.5 (Subscription Disclaimers), 9 (Miscellaneous Legal Terms), and 10 (Dispute Resolution).\n                            <br/><br/>\n                            <h4>9.2 Disclaimers</h4>\n                            &emsp;It may happen that our platform is down, either for planned maintenance or because something goes down with the site. It may happen that one of our instructors is making misleading statements in their content. It may also happen that we encounter security issues. These are just examples. You accept that you will not have any recourse against us in any of these types of cases where things don’t work out right. In legal, more complete language, the Services and their content are provided on an “as is” and “as available” basis. We (and our affiliates, suppliers, partners, and agents) make no representations or warranties about the suitability, reliability, availability, timeliness, security, lack of errors, or accuracy of the Services or their content, and expressly disclaim any warranties or conditions (express or implied), including implied warranties of merchantability, fitness for a particular purpose, title, and non-infringement. We (and our affiliates, suppliers, partners, and agents) make no warranty that you will obtain specific results from use of the Services. Your use of the Services (including any content) is entirely at your own risk. Some jurisdictions don’t allow the exclusion of implied warranties, so some of the above exclusions may not apply to you.\n                            We may decide to cease making available certain features of the Services at any time and for any reason. Under no circumstances will MSAEZ or its affiliates, suppliers, partners or agents be held liable for any damages due to such interruptions or lack of availability of such features.\n                            We are not responsible for delay or failure of our performance of any of the Services caused by events beyond our reasonable control, like an act of war, hostility, or sabotage; natural disaster; electrical, internet, or telecommunication outage; or government restrictions.\n                            <br/><br/>\n                            <h4>9.3 Limitation of Liability</h4>\n                            &emsp;There are risks inherent to using our Services, for example, if you access health and wellness content like yoga, and you injure yourself. You fully accept these risks and you agree that you will have no recourse to seek damages against even if you suffer loss or damage from using our platform and Services. In legal, more complete language, to the extent permitted by law, we (and our group companies, suppliers, partners, and agents) will not be liable for any indirect, incidental, punitive, or consequential damages (including loss of data, revenue, profits, or business opportunities, or personal injury or death), whether arising in contract, warranty, tort, product liability, or otherwise, and even if we’ve been advised of the possibility of damages in advance. Our liability (and the liability of each of our group companies, suppliers, partners, and agents) to you or any third parties under any circumstance is limited to the greater of one hundred dollars ($100) or the amount you have paid us in the twelve (12) months before the event giving rise to your claims. Some jurisdictions don’t allow the exclusion or limitation of liability for consequential or incidental damages, so some of the above may not apply to you.\n                            <br/><br/>\n                            <h4>9.4 Indemnification</h4>\n                            &emsp;If you behave in a way that gets us in legal trouble, we may exercise legal recourse against you. You agree to indemnify, defend (if we so request), and hold harmless MSAEZ, our group companies, and their officers, directors, suppliers, partners, and agents from an against any third-party claims, demands, losses, damages, or expenses (including reasonable attorney fees) arising from (a) the content you post or submit, (b) your use of the Services (c) your violation of these Terms, or (d) your violation of any rights of a third party. Your indemnification obligation will survive the termination of these Terms and your use of the Services.\n                            <br/><br/>\n                            <h4>9.5 Governing Law and Jurisdiction</h4>\n                            &emsp;When these Terms mention “MSAEZ,” they’re referring to the MSAEZ entity that you’re contracting with. If you’re a student, your contracting entity and governing law will generally be determined based on your location.\n                            If you’re a student located in India, you’re contracting with MSAEZ India LLP and these Terms are governed by the laws of India, without reference to its choice or conflicts of law principles, and you consent to the exclusive jurisdiction and venue of the courts in Delhi, India.\n                            If you’re a student located in a geographical region other than India, or if you’re accessing our Services as an instructor, you’re contracting with MSAEZ, Inc. and these Terms are governed by the laws of the State of California, USA without reference to its choice or conflicts of law principles. In cases where the “Dispute Resolution” section below doesn’t apply to you, you consent to the exclusive jurisdiction and venue of federal and state courts in San Francisco, California, USA.\n                            <br/><br/>\n                            <h4>9.6 Legal Actions and Notices</h4>\n                            &emsp;No action, regardless of form, arising out of or relating to this Agreement may be brought by either party more than one (1) year after the cause of action has accrued, except where this limitation cannot be imposed by law.\n                            Any notice or other communication to be given hereunder will be in writing and given by registered or certified mail return receipt requested, or email (by us to the email associated with your account or by you to help@uengine.org).\n                            <br/><br/>\n                            <h4>9.7 Relationship Between Us</h4>\n                            &emsp;You and we agree that no joint venture, partnership, employment, contractor, or agency relationship exists between us.\n                            <br/><br/>\n                            <h4>9.8 No Assignment</h4>\n                            You may not assign or transfer these Terms (or the rights and licenses granted under them). For example, if you registered an account as an employee of a company, your account cannot be transferred to another employee. We may assign these Terms (or the rights and licenses granted under them) to another company or person without restriction. Nothing in these Terms confers any right, benefit, or remedy on any third-party person or entity. You agree that your account is non-transferable and that all rights to your account and other rights under these Terms terminate upon your death.\n                            <br/><br/>\n                            <h4>9.9 Sanctions and Export Laws</h4>\n                            &emsp;You warrant that you (as an individual or as a representative of any entity on whose behalf you use the Services) aren’t located in, or a resident of, any country that is subject to applicable U.S. trade sanctions or embargoes (such as Cuba, Iran, North Korea, Sudan, Syria, or the Crimea region of Ukraine). You also warrant that you aren’t a person or entity who is named on any U.S. government specially designated national or denied-party list.\n                            If you become subject to such a restriction during the term of any agreement with MSAEZ, you will notify us within 24 hours, and we will have the right to terminate any further obligations to you, effective immediately and with no further liability to you (but without prejudice to your outstanding obligations to MSAEZ).\n                            You may not access, use, export, re-export, divert, transfer or disclose any portion of the Services or any related technical information or materials, directly or indirectly, in violation of any United States and other applicable country export control and trade sanctions laws, rules and regulations. You agree not to upload any content or technology (including information on encryption) whose export is specifically controlled under such laws.\n                            <br/><br/>\n\n                            <h3>10. Dispute Resolution</h3>\n                            &emsp;If there’s a dispute, our Support Team is happy to help resolve the issue. If that doesn’t work and you live in the United States or Canada, your options are to go to small claims court or bring a claim in binding arbitration; you may not bring that claim in another court or participate in a non-individual class action claim against us.\n                            This Dispute Resolution section applies only if you live in the United States or Canada. Most disputes can be resolved, so before bringing a formal legal case, please first try contacting our Support Team.\n                            <br/><br/>\n                            <h4>10.1 Small Claims</h4>\n                            &emsp;Either of us can bring a claim in small claims court in (a) San Francisco, California, (b) the county where you live, or (c) another place we both agree on, as long as it qualifies to be brought in that court.\n                            <br/><br/>\n                            <h4>10.2 Going to Arbitration</h4>\n                            &emsp;If we can’t resolve our dispute amicably, you and MSAEZ agree to resolve any claims related to these Terms (or our other legal terms) through final and binding arbitration, regardless of the type of claim or legal theory. If one of us brings a claim in court that should be arbitrated and the other party refuses to arbitrate it, the other party can ask a court to force us both to go to arbitration (compel arbitration). Either of us can also ask a court to halt a court proceeding while an arbitration proceeding is ongoing.\n                            <br/><br/>\n                            <h4>10.3 The Arbitration Process</h4>\n                            &emsp;Any disputes that involve a claim of less than $10,000 USD must be resolved exclusively through binding non-appearance-based arbitration. A party electing arbitration must initiate proceedings by filing an arbitration demand with the American Arbitration Association (AAA). The arbitration proceedings shall be governed by the AAA Commercial Arbitration Rules, Consumer Due Process Protocol, and Supplementary Procedures for Resolution of Consumer-Related Disputes. You and we agree that the following rules will apply to the proceedings: (a) the arbitration will be conducted by telephone, online, or based solely on written submissions (at the choice of the party seeking relief); (b) the arbitration must not involve any personal appearance by the parties or witnesses (unless we and you agree otherwise); and (c) any judgment on the arbitrator’s rendered award may be entered in any court with competent jurisdiction. Disputes that involve a claim of more than $10,000 USD must be resolved per the AAA’s rules about whether the arbitration hearing has to be in-person.\n                            <br/><br/>\n                            <h4>10.4 No Class Actions</h4>\n                            &emsp;We both agree that we can each only bring claims against the other on an individual basis. This means: (a) neither of us can bring a claim as a plaintiff or class member in a class action, consolidated action, or representative action; (b) an arbitrator can’t combine multiple people’s claims into a single case (or preside over any consolidated, class, or representative action); and (c) an arbitrator’s decision or award in one person’s case can only impact that user, not other users, and can’t be used to decide other users’ disputes. If a court decides that this “No class actions” clause isn’t enforceable or valid, then this “Dispute Resolution” section will be null and void, but the rest of the Terms will still apply.\n                            <br/><br/>\n                            <h4>10.5 Changes</h4>\n                            &emsp;Notwithstanding the “Updating these Terms” section below, if MSAEZ changes this \"Dispute Resolution\" section after the date you last indicated acceptance to these Terms, you may reject any such change by providing MSAEZ written notice of such rejection by mail or hand delivery to MSAEZ Attn: 502, 18, Sinbanpo-ro 45-gil, Seocho-gu, Seoul, Republic of Korea, or by email from the email address associated with your Account to help@uengine.org, within 30 days of the date such change became effective, as indicated by the \"last updated on\" language above. To be effective, the notice must include your full name and clearly indicate your intent to reject changes to this \"Dispute Resolution\" section. By rejecting changes, you are agreeing that you will arbitrate any dispute between you and MSAEZ in accordance with the provisions of this \"Dispute Resolution\" section as of the date you last indicated acceptance to these Terms.\n                            <br/><br/>\n\n                            <h3>11. Updating These Terms</h3>\n                            &emsp;From time to time, we may update these Terms to clarify our practices or to reflect new or different practices (such as when we add new features), and MSAEZ reserves the right in its sole discretion to modify and/or make changes to these Terms at any time. If we make any material change, we will notify you using prominent means, such as by email notice sent to the email address specified in your account or by posting a notice through our Services. Modifications will become effective on the day they are posted unless stated otherwise.\n                            Your continued use of our Services after changes become effective shall mean that you accept those changes. Any revised Terms shall supersede all previous Terms.\n                            <br/><br/>\n\n                            <h3>12. How to Contact Us</h3>\n                            &emsp;The best way to get in touch with us is to contact our Support Team. We’d love to hear your questions, concerns, and feedback about our Services.\n                            <br/><br/>\n                            Thanks for using tool and learning with us!<br/>",
    "privacy": "This Privacy Policy was last updated on May 1, 2021.<br/> <br/>\n\n Thank you for joining one of the world’s largest online learning marketplaces. We at MSAEZ (“MSAEZ”, “we”, “us”) respect your privacy and want you to understand how we collect, use, and share data about you. This Privacy Policy covers our data collection practices and describes your rights to access, correct, or restrict our use of your personal data.\n                            <br/> <br/>\n                            Unless we link to a different policy or state otherwise, this Privacy Policy applies when you visit or use the MSAEZ websites, mobile applications, APIs or related services (the “Services”). It also applies to prospective customers of our business and enterprise products.\n                            <br/> <br/>\n                            By using the Services, you agree to the terms of this Privacy Policy. You shouldn’t use the Services if you don’t agree with this Privacy Policy or any other agreement that governs your use of the Services.\n                            <br/> <br/>\n                            <h3>Table of Contents</h3>\n                            &emsp;1. What Data We Get <br/>\n                            &emsp;2. How We Get Data About You <br/>\n                            &emsp;3. What We Use Your Data For <br/>\n                            &emsp;4. Who We Share Your Data With <br/>\n                            &emsp;5. Security <br/>\n                            &emsp;6. Your Rights <br/>\n                            &emsp;7. Jurisdiction-Specific Rules <br/>\n                            &emsp;8. Updates & Contact Info <br/>\n                            <br/><br/>\n                            <h3>1. What Data We Get</h3>\n                            We collect certain data from you directly, like information you enter yourself, data about your consumption of content, and data from third-party platforms you connect with MSAEZ. We also collect some data automatically, like information about your device and what parts of our Services you interact with or spend time using.\n                            <h4>1.1 Data You Provide to Us</h4>\n                            We may collect different data from or about you depending on how you use the Services. Below are some examples to help you better understand the data we collect.\n                            <br/><br/>\n                            When you create an account and use the Services, including through a third-party platform, we collect any data you provide directly, including:\n                            <br/>\n\n\n                            <table border=\"1px\">\n                                <tr>\n                                    <td width=\"200\"> Account Data</td>\n                                    <td> In order to use certain features (like accessing content), you need to create a user account. When you create or update your account, we collect and store the data you provide, like your email address, password, phone number, occupation, skill interests, gender, race, ethnicity, government ID information, verification photo, age, date of birth, and account settings and assign you a unique identifying number (“Account Data”).</td>\n                                </tr>\n                                <tr >\n                                    <td width=\"200\">Profile Data</td>\n                                    <td> You can also choose to provide profile information like a photo, headline, biography, language, website link, social media profiles, country, or other data. Your Profile Data will be publicly viewable by others.</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Shared Content</td>\n                                    <td> Parts of the Services let you interact with other users or share content publicly, including by posting reviews about content, asking or answering questions, sending messages to students or instructors, or posting photos or other work you upload. Such shared content may be publicly viewable by others depending on where it is posted.</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Educational Content Data</td>\n                                    <td> When you access content, we collect certain data including which courses, assignments, labs, workspaces, and quizzes you’ve started and completed; content purchases and credits; subscriptions; completion certificates; your exchanges with instructors, teaching assistants, and other students; and essays, answers to questions, and other items submitted to satisfy course and related content requirements. If you are an instructor, we store your educational content which may contain data about you.</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Student Payment Data</td>\n                                    <td> If you make purchases, we collect certain data about your purchase (such as your name and ZIP code) as necessary to process your order. You must provide certain payment and billing data directly to our payment service providers, including your name, credit card information, billing address, and ZIP code. We may also receive limited information, like the fact that you have a new card and the last four digits of that card, from payment service providers to facilitate payments. For security, MSAEZ does not collect or store sensitive cardholder data, such as full credit card numbers or card authentication data.</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Instructor Payment Data</td>\n                                    <td> If you are an instructor, you can link your PayPal, Payoneer, or other payment account to the Services to receive payments. When you link a payment account, we collect and use certain information, including your payment account email address, account ID, physical address, or other data necessary for us to send payments to your account. In some instances, we may collect ACH or wire information to send payments to your account. In order to comply with applicable laws, we also work with trusted third parties who collect tax information as legally required. This tax information may include residency information, tax identification numbers, biographical information, and other personal information necessary for taxation purposes. For security, MSAEZ does not collect or store sensitive bank account information. The collection, use, and disclosure of your payment, billing, and taxation data is subject to the privacy policy and other terms of your payment account provider.</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Data About Your Accounts on Other Services</td>\n                                    <td> We may obtain certain information through your social media or other online accounts if they are connected to your MSAEZ account. If you login to MSAEZ via Facebook or another third-party platform or service, we ask for your permission to access certain information about that other account. For example, depending on the platform or service we may collect your name, profile picture, account ID number, login email address, location, physical location of your access devices, gender, birthday, and list of friends or contacts.\n                                        Those platforms and services make information available to us through their APIs. The information we receive depends on what information you (via your privacy settings) or the platform or service decide to give us.\n                                        If you access or use our Services through a third-party platform or service, or click on any third-party links, the collection, use, and sharing of your data will also be subject to the privacy policies and other agreements of that third party.\n                                    </td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Sweepstakes, Promotions, and Surveys</td>\n                                    <td>We may invite you to complete a survey or participate in a promotion (like a contest, sweepstakes, or challenge), either through the Services or a third-party platform. If you participate, we will collect and store the data you provide as part of participating, such as your name, email address, postal address, date of birth, or phone number. That data is subject to this Privacy Policy unless otherwise stated in the official rules of the promotion or in another privacy policy. The data collected will be used to administer the promotion or survey, including for notifying winners and distributing rewards. To receive a reward, you may be required to allow us to post some of your information publicly (like on a winner’s page). Where we use a third-party platform to administer a survey or promotion, the third party’s privacy policy will apply.</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Communications and Support</td>\n                                    <td>If you contact us for support or to report a problem or concern (regardless of whether you have created an account), we collect and store your contact information, messages, and other data about you like your name, email address, messages, location, MSAEZ user ID, refund transaction IDs, and any other data you provide or that we collect through automated means (which we cover below). We use this data to respond to you and research your question or concern, in accordance with this Privacy Policy.</td>\n                                </tr>\n                            </table>\n                            <br/><br/>\n\n                            <h4>1.2 Data We Collect through Automated Means</h4>\n                            When you access the Services (including browsing content), we collect certain data by automated means, including:\n                            <br/>\n                            <table border=\"1px\">\n                                <tr >\n                                    <td width=\"200\">System Data\t</td>\n                                    <td> Technical data about your computer or device, like your IP address, device type, operating system type and version, unique device identifiers, browser, browser language, domain and other systems data, and platform types (“System Data”).</td>\n                                </tr>\n                                <tr >\n                                    <td width=\"200\">Usage Data</td>\n                                    <td> Usage statistics about your interactions with the Services, including content accessed, time spent on pages or the Service, pages visited, features used, your search queries, click data, date and time, referrer, and other data regarding your use of the Services (“Usage Data”).</td>\n                                </tr>\n                                <tr>\n                                    <td width=\"200\">Approximate Geographic Data</td>\n                                    <td> An approximate geographic location, including information like country, city, and geographic coordinates, calculated based on your IP address.</td>\n                                </tr>\n                            </table>\n                            <br/><br/>\n                            <h4>1.3 Data From Third Parties</h4>\n                            If you are a MSAEZ Business enterprise or corporate prospect, we may collect certain business contact information from third-party commercial sources.\n                            <br/><br/>\n                            <h3>2. How We Get Data About You</h3>\n                            We use tools like cookies, web beacons, and similar tracking technologies to gather the data listed above. Some of these tools offer you the ability to opt out of data collection.\n                            <br/><br/>\n                            <h4>2.1 Cookies and Data Collection Tools</h4>\n                            We use cookies, which are small text files stored by your browser, to collect, store, and share data about your activities across websites, including on MSAEZ. They allow us to remember things about your visits to MSAEZ, like your preferred language, and to make the site easier to use. To learn more about cookies, visit https://cookiepedia.co.uk/all-about-cookies.\n                            <br/><br/>\n                            MSAEZ and service providers acting on our behalf (like Google Analytics and third-party advertisers) use server log files and automated data collection tools like cookies, tags, scripts, customized links, device or browser fingerprints, and web beacons (together, “Data Collection Tools“) when you access and use the Services. These Data Collection Tools automatically track and collect certain System Data and Usage Data (as detailed in Section 1) when you use the Services. In some cases, we tie data gathered through those Data Collection Tools to other data that we collect as described in this Privacy Policy.\n                            <br/><br/>\n                            <h4>2.2 Why We Use Data Collection Tools</h4>\n                            MSAEZ uses the following types of Data Collection Tools for the purposes described:\n                            <br/><br/>\n\n                            <ul>\n                                <li><u>Strictly Necessary:</u> These Data Collection Tools enable you to access the site, provide basic functionality (like logging in or accessing content), secure the site, protect against fraudulent logins, and detect and prevent abuse or unauthorized use of your account. These are required for the Services to work properly, so if you disable them, parts of the site will break or be unavailable.</li>\n                                <li><u>Functional:</u> These Data Collection Tools remember data about your browser and your preferences, provide additional site functionality, customize content to be more relevant to you, and remember settings affecting the appearance and behavior of the Services (like your preferred language or volume level for video playback).</li>\n                                <li><u>Performance:</u>These Data Collection Tools help measure and improve the Services by providing usage and performance data, visit counts, traffic sources, or where an application was downloaded from. These tools can help us test different versions of MSAEZ to see which features or content users prefer and determine which email messages are opened.</li>\n                                <li><u>Advertising:</u> These Data Collection Tools are used to deliver relevant ads (on the site and/or other sites) based on things we know about you like your Usage and System Data (as detailed in Section 1), and things that the ad service providers know about you based on their tracking data. The ads can be based on your recent activity or activity over time and across other sites and services. To help deliver tailored advertising, we may provide these service providers with a hashed, anonymized version of your email address (in a non-human-readable form) and content that you share publicly on the Services.</li>\n                                <li><u>Social Media:</u> These Data Collection Tools enable social media functionality, like sharing content with friends and networks. These cookies may track a user or device across other sites and build a profile of user interests for targeted advertising purposes.</li>\n                            </ul>\n                            <br/><br/>\n                            You can set your web browser to alert you about attempts to place cookies on your computer, limit the types of cookies you allow, or refuse cookies altogether. If you do, you may not be able to use some or all features of the Services, and your experience may be different or less functional. To learn more about managing Data Collection Tools, refer to Section 6.1 (Your Choices About the Use of Your Data) below.\n                            <br/><br/>\n\n                            <h3>3. What We Use Your Data For</h3>\n                            We use your data to do things like provide our Services, communicate with you, troubleshoot issues, secure against fraud and abuse, improve and update our Services, analyze how people use our Services, serve personalized advertising, and as required by law or necessary for safety and integrity.\n                            <br/><br/>\n                            We use the data we collect through your use of the Services to:\n                            <br/><br/>\n                            <ul>\n                                <li>Provide and administer the Services, including to facilitate participation in educational content, issue completion certificates, display customized content, and facilitate communication with other users;</li>\n                                <li>Process payments to instructors and other third parties;</li>\n                                <li>Process your requests and orders for educational content, products, specific services, information, or features;</li>\n                                <li>Communicate with you about your account by:\n                                    <br/>&emsp;&emsp;- Responding to your questions and concerns;\n                                    <br/>&emsp;&emsp;- Sending you administrative messages and information, including messages from instructors, students, and teaching assistants; notifications about changes to our Service; and updates to our agreements;\n                                    <br/>&emsp;&emsp;- Sending you information, such as by email or text messages, about your progress in courses and related content, rewards programs, new services, new features, promotions, newsletters, and other available instructor-created content (which you can opt out of at any time);\n                                    <br/>&emsp;&emsp;- Sending push notifications to your wireless device to provide updates and other relevant messages (which you can manage from the “options” or “settings” page of the mobile app);\n                                <li>Manage your account and account preferences;\n                                <li>Facilitate the Services’ technical functioning, including troubleshooting and resolving issues, securing the Services, and preventing fraud and abuse;</li>\n                                <li>Solicit feedback from users;</li>\n                                <li>Market products, services, surveys, and promotions;</li>\n                                <li>Market Subscription Plans to prospective customers;</li>\n                                <li>Learn more about you by linking your data with additional data through third-party data providers and/or analyzing the data with the help of analytics service providers;</li>\n                                <li>Identify unique users across devices;</li>\n                                <li>Tailor advertisements across devices;</li>\n                                <li>Improve our Services and develop new products, services, and features;</li>\n                                <li>Analyze trends and traffic, track purchases, and track usage data;</li>\n                                <li>Advertise the Services on third-party websites and applications;</li>\n                                <li>As required or permitted by law; or</li>\n                                <li>As we, in our sole discretion, otherwise determine to be necessary to ensure the safety or integrity of our users, employees, third parties, the public, or our Services.</li>\n                            </ul>\n                            <br/><br/>\n\n                            <h3>4. Who We Share Your Data With</h3>\n                            We share certain data about you with instructors, other students, companies performing services for us, MSAEZ affiliates, our business partners, analytics and data enrichment providers, your social media providers, companies helping us run promotions and surveys, and advertising companies who help us promote our Services. We may also share your data as needed for security, legal compliance, or as part of a corporate restructuring. Lastly, we can share data in other ways if it is aggregated or de-identified or if we get your consent.\n                            <br/>\n                            We may share your data with third parties under the following circumstances or as otherwise described in this Privacy Policy:\n                            <br/><br/>\n                            <ul>\n                                <li><u>With Your Instructors:</u>We share data that we have about you (except your email address) with instructors or teaching assistants for educational content you access or request information about, so they can improve their content for you and other students. This data may include things like your city, country, browser language, operating system, device settings, the site that brought you to MSAEZ, and your activities on MSAEZ. If we collect additional data about you (like age or gender), we may share that too. We will not share your email address with instructors or teaching assistants.</li>\n                                <li><u>With Other Students and Instructors:</u>Depending on your settings, your shared content and profile data may be publicly viewable, including to other students and instructors. If you ask a question to an instructor or teaching assistant, your information (including your name) may also be publicly viewable.</li>\n                                <li><u>With Service Providers, Contractors, and Agents:</u>We share your data with third-party companies who perform services on our behalf, like payment processing, fraud and abuse prevention, data analysis, marketing and advertising services (including retargeted advertising), email and hosting services, and customer services and support. These service providers may access your personal data and are required to use it solely as we direct, to provide our requested service.</li>\n                                <li><u>With MSAEZ Affiliates:</u>We may share your data within our corporate family of companies that are related by common ownership or control to enable or support us in providing the Services.</li>\n                                <li><u>With Business Partners: :</u>We have agreements with other websites and platforms to distribute our Services and drive traffic to MSAEZ. For example, we work with Benesse in Japan. Depending on your location, we may share your data with these partners.</li>\n                                <li><u>With Analytics and Data Enrichment Services:</u>As part of our use of third-party analytics tools like Google Analytics and data enrichment services like ZoomInfo, we share certain contact information, Account Data, System Data, Usage Data (as detailed in Section 1), or de-identified data as needed. De-identified data means data where we’ve removed things like your name and email address and replaced it with a token ID. This allows these providers to provide analytics services or match your data with publicly-available database information (including contact and social information from other sources). We do this to communicate with you in a more effective and customized manner.</li>\n                                <li><u>To Power Social Media Features:</u>The social media features in the Services (like the Facebook Like button) may allow the third-party social media provider to collect things like your IP address and which page of the Services you’re visiting, and to set a cookie to enable the feature. Your interactions with these features are governed by the third-party company’s privacy policy.</li>\n                                <li><u>To Administer Promotions and Surveys:</u> We may share your data as necessary to administer, market, or sponsor promotions and surveys you choose to participate in, as required by applicable law (like to provide a winners list or make required filings), or in accordance with the rules of the promotion or survey.</li>\n                                <li><u>For Advertising:</u>If we decide to use an advertising-supported revenue model in the future, we may use and share certain System Data and Usage Data with third-party advertisers and networks to show general demographic and preference information among our users. We may also allow advertisers to collect System Data through Data Collection Tools (as detailed in Section 2.1), to use this data to offer you targeted ad delivery to personalize your user experience (through behavioral advertising), and to undertake web analytics. Advertisers may also share with us the data they collect about you. To learn more or opt out from participating ad networks’ behavioral advertising, see Section 6.1 (Your Choices About the Use of Your Data) below. Note that if you opt out, you’ll continue to be served generic ads.</li>\n                                <li><u>For Security and Legal Compliance:</u>\n                                    We may disclose your data to third parties if we (in our sole discretion) have a good faith belief that the disclosure is:\n                                    <br/>&emsp;- Permitted or required by law;\n                                    <br/>&emsp;- Requested as part of a judicial, governmental, or legal inquiry, order, or proceeding;\n                                    <br/>&emsp;- Reasonably necessary as part of a valid subpoena, warrant, or other legally-valid request;\n                                    <br/>&emsp;- Reasonably necessary to enforce our Terms of Use, Privacy Policy, and other legal agreements;\n                                    <br/>&emsp;- Required to detect, prevent, or address fraud, abuse, misuse, potential violations of law (or rule or regulation), or security or technical issues; or\n                                    <br/>&emsp;- Reasonably necessary in our discretion to protect against imminent harm to the rights, property, or safety of MSAEZ, our users, employees, members of the public, or our Services.\n                                    <br/>&emsp;-We may also disclose data about you to our auditors and legal advisors in order to assess our disclosure obligations and rights under this Privacy Policy.\n                                </li>\n                                <li><u>During a Change in Control:</u>If MSAEZ undergoes a business transaction like a merger, acquisition, corporate divestiture, or dissolution (including bankruptcy), or a sale of all or some of its assets, we may share, disclose, or transfer all of your data to the successor organization during such transition or in contemplation of a transition (including during due diligence).</li>\n                                <li><u>After Aggregation/De-identification:</u>We may disclose or use aggregated or de-identified data for any purpose.</li>\n                                <li><u>With Your Permission:</u>With your consent, we may share data to third parties outside the scope of this Privacy Policy.</li>\n                            </ul>\n                            <br/><br/>\n\n                            <h3>5. Security</h3>\n                            We use appropriate security based on the type and sensitivity of data being stored. As with any internet-enabled system, there is always a risk of unauthorized access, so it’s important to protect your password and to contact us if you suspect any unauthorized access to your account.\n                            MSAEZ takes appropriate security measures to protect against unauthorized access, alteration, disclosure, or destruction of your personal data that we collect and store. These measures vary based on the type and sensitivity of the data. Unfortunately, however, no system can be 100% secured, so we cannot guarantee that communications between you and MSAEZ, the Services, or any information provided to us in connection with the data we collect through the Services will be free from unauthorized access by third parties. Your password is an important part of our security system, and it is your responsibility to protect it. You should not share your password with any third party, and if you believe your password or account has been compromised, you should change it immediately and contact our Support Team with any concerns.\n                            <br/><br/>\n\n                            <h3>6. Your Rights</h3>\n                            You have certain rights around the use of your data, including the ability to opt out of promotional emails, cookies, and collection of your data by certain third parties. You can update or terminate your account from within our Services, and can also contact us for individual rights requests about your personal data. Parents who believe we’ve unintentionally collected personal data about their underage child should contact us for help deleting that information.\n                            <br/><br/>\n\n                            <h4>6.1 Your Choices About the Use of Your Data</h4>\n                            You can choose not to provide certain data to us, but you may not be able to use certain features of the Services.\n                            <ul>\n                                <li>To stop receiving promotional communications from us, you can opt out by using the unsubscribe mechanism in the promotional communication you receive or by changing the email preferences in your account. Note that regardless of your email preference settings, we will send you transactional and relationship messages regarding the Services, including administrative confirmations, order confirmations, important updates about the Services, and notices about our policies.</li>\n                                <li>If you’re located in the European Economic Area, you may opt out of certain Data Collection Tools by clicking the “Cookie settings“ link at the bottom of any page.</li>\n                                <li>The browser or device you use may allow you to control cookies and other types of local data storage. To learn more about managing cookies, visit https://cookiepedia.co.uk/how-to-manage-cookies. Your wireless device may also allow you to control whether location or other data is collected and shared.</li>\n                                <li>To get information and control cookies used for tailored advertising from participating companies, see the consumer opt-out pages for the Network Advertising Initiative and Digital Advertising Alliance, or if you’re located in the European Economic Area, visit the Your Online Choices site. To opt out of Google’s display advertising or customize Google Display Network ads, visit the Google Ads Settings page. To opt out of Taboola’s targeted ads, see the Opt-out Link in their Cookie Policy.</li>\n                                <li>To opt out of allowing Google Analytics, Mixpanel, ZoomInfo, or Clearbit to use your data for analytics or enrichment, see the Google Analytics Opt-out Browser Add-on, Mixpanel Opt-Out Cookie, ZoomInfo’s policy, and Clearbit data claiming mechanism.</li>\n                                <li>Apple iOS, Android OS, and Microsoft Windows each provide their own instructions on how to control in-app tailored advertising. For other devices and operating systems, you should review your privacy settings on that platform.</li>\n                            </ul>\n                            <br/><br/>\n                            If you have any questions about your data, our use of it, or your rights, contact us at help@uengine.org.\n                            <br/><br/>\n\n                            <h4>6.2 Accessing, Updating, and Deleting Your Personal Data</h4>\n                            You can access and update your personal data that MSAEZ collects and maintains as follows:\n                            <ul>\n                                <li>To update data you provide directly, log into your account and update your account at any time.</li>\n                                <li>To terminate your account:\n                                    <br/>&emsp;- If you are a student, visit your profile settings page and follow the steps detailed here.\n                                    <br/>&emsp;- If you are an instructor, follow the steps detailed here.\n                                    <br/>&emsp;- If you have any issues terminating your account, please contact our Support Team.\n                                    <br/>&emsp;- Please note: even after your account is terminated, some or all of your data may still be visible to others, including without limitation any data that has been (a) copied, stored, or disseminated by other users (including comments on content); (b) shared or disseminated by you or others (including in your shared content); or (c) posted to a third-party platform. Even after your account is terminated, we retain your data for as long as we have a legitimate purpose to do so (and in accordance with applicable law), including to assist with legal obligations, resolve disputes, and enforce our agreements. We may retain and disclose such data pursuant to this Privacy Policy after your account has been terminated.\n                                </li>\n                                <li>To request to access, correct, or delete your personal data, please use our online form here. You can also submit these requests by emailing help@uengine.org or writing to us at MSAEZ, Attn: 502, 18, Sinbanpo-ro 45-gil, Seocho-gu, Seoul, Republic of Korea. Please allow up to 30 days for a response. For your protection, we may require that the request be sent through the email address associated with your account, and we may need to verify your identity before implementing your request. Please note that we retain certain data where we have a lawful basis to do so, including for mandatory record-keeping and to complete transactions.</li>\n                            </ul>\n                            <br/><br/>\n\n                            <h4>6.3 Our Policy Concerning Children</h4>\n                            We recognize the privacy interests of children and encourage parents and guardians to take an active role in their children’s online activities and interests. Individuals younger than 18 years of age, but of the required age for consent to use online services where they live (for example, 13 in the US or 16 in Ireland), may not set up an account, but may have a parent or guardian open an account and help them access appropriate content. Individuals younger than the required age for consent to use online services may not use the Services. If we learn that we’ve collected personal data from a child under those ages, we will take reasonable steps to delete it.\n\n                            Parents who believe that MSAEZ may have collected personal data from a child under those ages can submit a request that it be removed to help@uengine.org.\n                            <br/><br/>\n\n                            <h3>7. Jurisdiction-Specific Rules</h3>\n                            If you live in California, you have certain rights related to accessing and deleting your data, as well as learning who we share your data with. If you live in Australia, you have the right to make a formal complaint with the appropriate government agency. Users outside of the United States should note that we transfer data to the US and other areas outside of the European Economic Area.\n                            <br/><br/>\n\n                            <h4>7.1 Users in California</h4>\n                            Users who are California residents have certain rights under the California Consumer Privacy Act, (“CCPA”). If you are an eligible California user, included in these rights are:\n\n                            <ul>\n                                <li><b>“Right to Know” - </b>You have the right to request to know more about the categories and specific pieces of personal information that we have collected about you and access a copy of your personal information.</li>\n                                <li><b>“Right to Deletion” — </b>You have the right to request deletion of personal information that we have collected about you.</li>\n                                <li><b>“Right to Non-Discrimination” - </b>If you choose to exercise any of your rights under CCPA, MSAEZ will treat you like all other users. In other words, there is no penalty for exercising your rights under CCPA.</li>\n                                <li><b>“Right to Opt-Out” - </b>You have the right to opt out of the sale of your personal information.</li>\n                            </ul>\n                            CCPA has a specific definition of a “sale” and while MSAEZ does not, in the traditional sense, sell your personal information or the personal information of any of our users, we do use cookies that make non-personally identifiable information available to select third-parties. To opt out of such a “sale,” click on the “Do Not Sell My Personal Information” link at the bottom of this page.\n                            <br/><br/>\n                            To exercise any of these rights under CCPA, please email help@uengine.org or write to us at MSAEZ, Attn: 502, 18, Sinbanpo-ro 45-gil, Seocho-gu, Seoul, Republic of Korea. CCPA allows you to designate an authorized agent to make these requests on your behalf. For your protection, we may require that the request be sent through the email address associated with your account, and we may need to verify you and/or your agent’s identity before fulfilling your request.\n                            <br/><br/>\n                            Additionally, for more information about the personal information we collect and how we collect it, please see the sections above entitled “What Data We Get” and “How We Get Data About You.”\n                            <br/><br/>\n                            To learn about the business and commercial purposes for which your personal information is collected and the categories of service providers who have access to your personal information, please see the sections above entitled “What We Use Your Data For” and “Who We Share Your Data With.”\n                            <br/><br/>\n                            As a California resident, you also have the right to request certain details about what personal information we share with third parties for those third parties’ direct marketing purposes. To submit your request, send an email to help@uengine.org with the phrase “California Shine the Light” and include your mailing address, state of residence, and email address.\n                            <br/><br/>\n                            Since there is no widely accepted standard for the browser-initiated Do Not Track signal, we do not currently recognize or respond to Do Not Track signals.\n                            <br/><br/>\n\n                            <h4>7.2 Users in Nevada</h4>\n                            MSAEZ does not sell its users’ personal information or personal data. Nonetheless, Nevada residents have the right to submit a request that we do not sell your covered personal information, which you can do by emailing help@uengine.org or writing to us at MSAEZ, Attn: 502, 18, Sinbanpo-ro 45-gil, Seocho-gu, Seoul, Republic of Korea.\n                            <br/><br/>\n\n                            <h4>7.3 Users in Australia</h4>\n                            If you are an Australia resident and you have a complaint, you may refer it to the office of the Australian Information Commissioner (“OAIC”). You can contact OAIC by visiting www.oaic.gov.au; forwarding an email to enquiries@oaic.gov.au; telephoning 1300 363 992; or writing to OAIC at GPO Box 5218, Sydney NSW 2001.\n                            <br/><br/>\n\n                            <h4>7.4 Users Outside of the U.S.</h4>\n                            In order to provide the Services to you, we must transfer your data to the United States and process it there. By visiting or using our Services, you consent to storage of your data on servers located in the United States. If you are using the Services from outside the United States, you consent to the transfer, storage, and processing of your data in and to the United States or other countries. Specifically, personal data collected in the United Kingdom (“UK”), Switzerland, and the European Economic Area (“EEA”) is transferred and stored outside those areas. Additionally, if you are located in the EEA, UK, or Switzerland, you also have the right to lodge a complaint with your data supervisory authority.\n                            <br/><br/>\n                            Personal data is also processed outside of the UK, Switzerland, and the EEA by our MSAEZ group companies, or our service providers, including to process transactions, facilitate payments, and provide support services as described in Section 4. We use Standard Contractual Clauses adopted. By submitting your data or using our Services, you consent to this transfer, storage, and processing by MSAEZ and its processors.\n                            <br/><br/>\n\n                            <h3>8. Updates & Contact Info</h3>\n                            When we make a material change to this policy, we’ll notify users via email, in-product notice, or another mechanism required by law. Changes become effective the day they’re posted. Please contact us via email or postal mail with any questions, concerns, or disputes.\n                            <br/><br/>\n                            <h4>8.1 Modifications to This Privacy Policy</h4>\n                            From time to time, we may update this Privacy Policy. If we make any material change to it, we will notify you via email, through a notification posted on the Services, or as required by applicable law. We will also include a summary of the key changes. Unless stated otherwise, modifications will become effective on the day they are posted.\n                            <br/><br/>\n                            As permitted by applicable law, if you continue to use the Services after the effective date of any change, then your access and/or use will be deemed an acceptance of (and agreement to follow and be bound by) the revised Privacy Policy. The revised Privacy Policy supersedes all previous Privacy Policies.\n                            <br/><br/>\n\n                            <h4>8.2 Interpretation</h4>\n                            Any capitalized terms not defined in this policy are defined as specified in MSAEZ's Terms of Use. Any version of this Privacy Policy in a language other than English is provided for convenience. If there is any conflict with a non-English version, you agree that the English language version will control.\n                            <br/><br/>\n\n                            <h4>8.3 Questions</h4>\n                            If you have any questions, concerns, or disputes regarding our Privacy Policy, please feel free to contact our privacy team (including our designated personal information protection manager) at help@uengine.org. You can also send postal mail to us at MSAEZ, Attn: 502, 18, Sinbanpo-ro 45-gil, Seocho-gu, Seoul, Republic of Korea.\n"
  }
}

